amalakkad93/amalakkad93-Microcontroller-applications-and-interfacing.-Using-Microchip-processor-PIC18F4620/8And9_Implementation of LCD Panel in a Traffic Light Controller and External Interrupts/Lab8Code.c
#include <stdio.h>
#include <stdlib.h>
#include <xc.h>
#include <math.h>
#include <p18f4620.h>

#pragma config OSC = INTIO67
#pragma config WDT = OFF
#pragma config LVP = OFF
#pragma config BOREN = OFF
#pragma config CCP2MX = PORTBE

#define debug 1
//LEDS
#define _XTAL_FREQ  8000000             // Set operation for 8 Mhz
#define TMR_CLOCK   _XTAL_FREQ/4        // Timer Clock 2 Mhz

#define TFT_DC      PORTDbits.RD0       // Location of TFT D/C
#define TFT_CS      PORTDbits.RD1       // Location of TFT Chip Select
#define TFT_RST     PORTDbits.RD2       // Location of TFT Reset

//colors
#define OFF         0                   //Defines OFF as decimal value 0
#define RED         1                   //Defines RED as decimal value 1
#define GREEN       2                   //Defines GREEN as decimal value 2
#define YELLOW      3                   // Defines YELLOW as decimal value 3

#define NS          0
#define NSLT        1
#define EW          2
#define EWLT        3

#define Circle_Size     7               // Size of Circle for Light
#define Circle_Offset   15              // Location of Circle
#define TS_1            1               // Size of Normal Text
#define TS_2            2               // Size of PED Text
#define Count_Offset    10              // Location of Count

#define XTXT            30              // X location of Title Text 
#define XRED            40              // X location of Red Circle
#define XYEL            60              // X location of Yellow Circle
#define XGRN            80              // X location of Green Circle
#define XCNT            100             // X location of Sec Count

#define NS              0               // Number definition of North/South
#define NSLT            1               // Number definition of North/South Left Turn
#define EW              2               // Number definition of East/West
#define EWLT            3               // Number definition of East/West Left Turn
 
#define Color_Off       0               // Number definition of Off Color
#define Color_Red       1               // Number definition of Red Color
#define Color_Green     2               // Number definition of Green Color
#define Color_Yellow    3               // Number definition of Yellow Color

#define NS_Txt_Y        20
#define NS_Cir_Y        NS_Txt_Y + Circle_Offset
#define NS_Count_Y      NS_Txt_Y + Count_Offset
#define NS_Color        ST7735_BLUE 

#define NSLT_Txt_Y      50
#define NSLT_Cir_Y      NSLT_Txt_Y + Circle_Offset
#define NSLT_Count_Y    NSLT_Txt_Y + Count_Offset
#define NSLT_Color      ST7735_MAGENTA

#define EW_Txt_Y        80
#define EW_Cir_Y        EW_Txt_Y + Circle_Offset
#define EW_Count_Y      EW_Txt_Y + Count_Offset
#define EW_Color        ST7735_CYAN

#define EWLT_Txt_Y      110
#define EWLT_Cir_Y      EWLT_Txt_Y + Circle_Offset
#define EWLT_Count_Y    EWLT_Txt_Y + Count_Offset
#define EWLT_Color      ST7735_WHITE

#define PED_NS_Count_Y  30
#define PED_EW_Count_Y  90
#define PED_Count_X     2
#define Switch_Txt_Y    140

#define PED_Count_NS    8
#define PED_Count_EW    9

#include "ST7735_TFT.c"

char buffer[31];                        // general buffer for display purpose
char *nbr;                              // general pointer used for buffer
char *txt;

char NS_Count[]     = "00";             // text storage for NS Count
char NSLT_Count[]   = "00";             // text storage for NS Left Turn Count
char EW_Count[]     = "00";             // text storage for EW Count
char EWLT_Count[]   = "00";             // text storage for EW Left Turn Count

char PED_NS_Count[] = "00";             // text storage for NS Pedestrian Count
char PED_EW_Count[] = "00";             // text storage for EW Pedestrian Count

char SW_NSPED_Txt[] = "0";              // text storage for NS Pedestrian Switch
char SW_NSLT_Txt[]  = "0";              // text storage for NS Left Turn Switch
char SW_EWPED_Txt[] = "0";              // text storage for EW Pedestrian Switch
char SW_EWLT_Txt[]  = "0";              // text storage for EW Left Turn Switch
char SW_MODE_Txt[]  = "D";              // text storage for Mode Light Sensor
	
char Act_Mode_Txt[]  = "D";             // text storage for Actual Mode
char EmergencyS_Txt[] = "0";            // text storage for Emergency Status
char EmergencyR_Txt[] = "0";            // text storage for Emergency Request
char dir;
char Count;                             // RAM variable for Second Count
char PED_Count;                         // RAM variable for Second Pedestrian Count

char SW_NSPED;                          // RAM variable for NS Pedestrian Switch
char SW_NSLT;                           // RAM variable for NS Left Turn Switch
char SW_EWPED;                          // RAM variable for EW Pedestrian Switch
char SW_EWLT;                           // RAM variable for EW Left Turn Switch
char SW_MODE;                           // RAM variable for Mode Light Sensor
char EMERGENCY;
char EMERGENCY_REQUEST;
int MODE;
char direction;
float volt;

#define SEC_LED  PORTEbits.RE0          //Defines SEC_LED as PORTE bit RE2

#define NS_RED   PORTAbits.RA1          // Defines NS_RED as PORTB bits RA1
#define NS_GREEN PORTAbits.RA2          // Defines NS_GREEN as PORTA bit RA2

#define NSLT_RED PORTAbits.RA3          // Defines NS_LT RED as PORTC bit RA3
#define NSLT_GREEN PORTAbits.RA4        // Defines NS_LT GREEN as PORTC bit RA4

#define EW_RED   PORTDbits.RD4          // Defines EW_RED as PORTC bit RB4
#define EW_GREEN PORTDbits.RD5          // Defines EW_GREEN as PORTC bit RB5

#define EWLT_RED PORTDbits.RD6          // Defines EWLT_RED as PORTD bit RD6
#define EWLT_GREEN PORTDbits.RD7        // Defines EWLT_GREEN as PORTD bit RD7

#define NS_LT_SW PORTBbits.RB4          // Defines NS_LT as PORTB bit RB4 for left turn
#define NS_PED_SW PORTBbits.RB0         // Defines NS_PED as PORTB bit RB0 for Ped-switch

#define EW_PED_SW PORTBbits.RB5         // Defines EW_PED as PORTB bit RB5 for Ped-switch
#define EW_LT_SW PORTBbits.RB1          // Defines EW_LT as PORTB bit RB1 for left turn

#define MODE_LED PORTDbits.RD3          // Defines MODE_LED as PORTD bit RD3,to differentiate day/night mode
    
