amalakkad93/amalakkad93-Microcontroller-applications-and-interfacing.-Using-Microchip-processor-PIC18F4620/8And9_Implementation of LCD Panel in a Traffic Light Controller and External Interrupts/Lab8Code.c
unsigned int get_full_ADC()
{
unsigned int result;
   ADCON0bits.GO=1;                     // Start Conversion
   while(ADCON0bits.DONE==1);           // wait for conversion to be completed
   result = (ADRESH * 0x100) + ADRESL;  // combine result of upper byte and
                                        // lower byte into result
   return result;                       // return the result.
}

void Set_NS(char color)
{
    direction = NS;
    update_color(direction, color);
    
    switch (color)
    {
        case OFF: NS_RED =0;NS_GREEN=0;break;           // Turns off the NS LED
        case RED: NS_RED =1;NS_GREEN=0;break;           // Sets NS LED RED
        case GREEN: NS_RED =0;NS_GREEN=1;break;         // sets NS LED GREEN
        case YELLOW: NS_RED =1;NS_GREEN=1;break;        // sets NS LED YELLOW
    }
}

void Set_NS_LT(char color)
{
    direction = NSLT;
    update_color(direction, color);
    
    switch (color)
    {
        case OFF: NSLT_RED =0;NSLT_GREEN=0;break;       // Turns off the NSLT LED
        case RED: NSLT_RED =1;NSLT_GREEN=0;break;       // Sets NSLT LED RED
        case GREEN: NSLT_RED =0;NSLT_GREEN=1;break;     // sets NSLT LED GREEN
        case YELLOW: NSLT_RED =1;NSLT_GREEN=1;break;    // sets NSLT LED YELLOW
    }
}

void Set_EW(char color)
{
    direction = EW;
    update_color(direction, color);
    
    switch (color)
    {
        case OFF: EW_RED =0;EW_GREEN=0;break;           // Turns off the NSLT LED
        case RED: EW_RED =1;EW_GREEN=0;break;           // Sets NSLT LED RED
        case GREEN: EW_RED =0;EW_GREEN=1;break;         // sets NSLT LED GREEN
        case YELLOW: EW_RED =1;EW_GREEN=1;break;        // sets NSLT LED YELLOW
    }
}

void Set_EW_LT(char color)
{
    direction = EWLT;
    update_color(direction, color);
    
    switch (color)
    {
        case OFF: EWLT_RED =0;EWLT_GREEN=0;break;       // Turns off the NSLT LED
        case RED: EWLT_RED =1;EWLT_GREEN=0;break;       // Sets NSLT LED RED
        case GREEN: EWLT_RED =0;EWLT_GREEN=1;break;     // sets NSLT LED GREEN
        case YELLOW: EWLT_RED =1;EWLT_GREEN=1;break;    // sets NSLT LED YELLOW
    }
}

void Activate_Buzzer()
{
    PR2 = 0b11111001 ; 
    T2CON = 0b00000101 ; 
    CCPR2L = 0b01001010 ; 
    CCP2CON = 0b00111100 ; 
}

void Deactivate_Buzzer()
{
    CCP2CON = 0x0; 
    PORTBbits.RB3 = 0;
}

void PED_Control( char direction, char Num_Sec)
{ 
    for(char i = Num_Sec-1;i>0; i--)
    {
        update_PED_Count(direction, i);
        Wait_One_Second_With_Beep();            // hold the number on 7-Segment for 1 second
    }
    
    update_PED_Count(direction, 0);             
    Wait_One_Second_With_Beep();                // leaves the 7-Segment off for 1 second
}

void Day_Mode()
{
    MODE = 1;                                   // turns on the MODE_LED
    MODE_LED = 1;
    Act_Mode_Txt[0] = 'D';
    drawtext(35,10, Act_Mode_Txt, ST7735_WHITE, ST7735_BLACK, TS_1);
    
    Set_NS_LT(RED);                              //Step 1: NS to Green, others to Red
    Set_EW(RED);
    Set_EW_LT(RED);
    Set_NS(GREEN);
    if (SW_NSPED==1)                            //Step 1a: Pedestrian present
        PED_Control(NS,9);                       //PED_Control for NS with 9 seconds
    Wait_N_Seconds(8);                          //Step 2: NS still Green and wait 3 seconds
    Set_NS(YELLOW);                             //Step 3: NS to Yellow and wait 3 seconds
    Wait_N_Seconds(3);
    Set_NS(RED);                                //Step 4: NS to Red
    
    if(SW_EWLT==1)                              //Step 5: Check EWLT
    {
        Set_EW_LT(GREEN);                       //Step 6: EWLT to Green and wait 7 seconds
        Wait_N_Seconds(7);
        Set_EW_LT(YELLOW);                      //Step 7: EWLT to Yellow and wait 3 seconds
        Wait_N_Seconds(3);
        Set_EW_LT(RED);                         //Step 8: EWLT to Red
    }
    
    Set_EW(GREEN);                              //Step 9: Turn EW to Green
    if(SW_EWPED == 1)                           //Step 9a: Pedestrian present
        PED_Control(EW,8);                       //PED_Control for EW with 8 seconds
    Wait_N_Seconds(7);                          //Step 10: EW stays Green, wait 7 seconds
    Set_EW(YELLOW);                             //Step 11: EW to Yellow, wait 3 seconds
    Wait_N_Seconds(3);                              
    Set_EW(RED);                                //Step 12: EW to Red
    
    if (SW_NSLT == 1)                           //Step 13: Check NSLT switch
    {
        Set_NS_LT(GREEN);                       //Step 14: NSLT to Green and wait 8 seconds
        Wait_N_Seconds(8);
        Set_NS_LT(YELLOW);                      //Step 15: NSLT to Yellow and wait 3
        Wait_N_Seconds(3);
        Set_NS_LT(RED);
    } 
}
void Night_Mode()
{ 
    MODE = 0;                                   // turns on the MODE_LED
    MODE_LED = 0;
    Act_Mode_Txt[0] = 'N';
    drawtext(35,10, Act_Mode_Txt, ST7735_WHITE, ST7735_BLACK, TS_1);
  
    Deactivate_Buzzer();
    Set_NS_LT(RED);                              //Step 1: NS to Green, others to Red
    Set_EW(RED);
    Set_EW_LT(RED);
    Set_NS(GREEN);
    Wait_N_Seconds(7);                          //Step 2: Wait 7 Seconds
    Set_NS(YELLOW);                             //Step 3: NS to Yellow and wait 3 seconds
    Wait_N_Seconds(3);
    Set_NS(RED);                                //Step 4: NS to Red
    
    if(SW_EWLT==1)                              //Step 5: Check EWLT
    {
        Set_EW_LT(GREEN);                       //Step 6: EWLT to Green and wait 7 seconds
        Wait_N_Seconds(7);                           
        Set_EW_LT(YELLOW);                      //Step 7: EWLT to Yellow and wait 3 seconds
        Wait_N_Seconds(3);
        Set_EW_LT(RED);                         //Step 8: EWLT to Red
    }
    
